/* Напишите программу, которая будет преобразовывать десятичное число в двоичное.
45 -> 101101
3  -> 11
2  -> 10
*/

Console.WriteLine("Введите число: ");
int num = int.Parse(Console.ReadLine()!);
string count = ""; // или String.Empty

while (num > 0)
{
    // count = count + num % 2; //обратный порядок 01
    count = num % 2 + count; //поэтому остаток от деления впереди строки
    num = num / 2;
}
Console.WriteLine(count);

//Например: 5
//= 0 + ""
//= 1 + 0
//= 0 + 10
//= 1 + 010

//Например 11
// 11 % 2 =1
// 11 / 2 = 5
// 5 % 2 = 1
// 5 / 2 = 2
// 2 % 2 = 0
// 2 / 2 =1
// 1 / 2 = 0

// =1 + ""
// = 1 + "1"
// = 0 + "11"
// = 1 + "011"

// 10
// 10 % 2 = 0
// 10 / 2 = 5
// 5 % 2 = 1 + '0' = '10'
// 5 / 2 = 2
// 2 % 2 = 0 + '10' = '010'
// 2 / 2 = 1
// 1 % 2 = 1 + '010' = '1010'
// 1 / 2 = 0
// 1010 = 1 * 2^3 + 0 * 2^2 + 1 * 2^ 1 + 0 * 2^0 = 8 + 2 = 10